# Video Link : https://www.youtube.com/watch?v=uuhi830wOzs

In [ ]:
## Python is a which type of language

In many books it's written as python is a interpreted language but that's half correct.
bcoz when you run your code firstly it compile into pyc file(Cimpier lang part)
then this pyc file is interpreted so python is both compile+interpreted language

In [1]:
#How to concanate two tuples:

t1=(1,'a',True)
t2=(4,5,6)

print(t1+t2)

(1, 'a', True, 4, 5, 6)

In [2]:
# Initialise numpy array with zeros

import numpy as np
arr=np.zeros((5,5))
arr

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [3]:
# Groupby

#Group by method is used to split and group the data

In [4]:
import pandas as pd

df=pd.DataFrame({'Vehile':['Kia','Audi','Bajaj'], 'Type':['Car','Car','Bikes']})
df

  Vehile   Type
0    Kia    Car
1   Audi    Car
2  Bajaj  Bikes

In [5]:
df.groupby('Type').count()

       Vehile
Type
Bikes       1
Car         2

In [6]:
#Can we create DataFrame from list?

bikes=['Bajaj','KTM','TVS','Honda','Hero']
cars= ['Farari','Kis','MG','Tata','Toyaya']

df=pd.DataFrame()

df['Cars']=cars
df['Bikes']=bikes
df

     Cars  Bikes
0  Farari  Bajaj
1     Kis    KTM
2      MG    TVS
3    Tata  Honda
4  Toyaya   Hero

In [7]:
#How to combine two dataframe using Join Function-----------
'''
Join is used when we need to extract data from different dataframe which are having one or more common column

Pandas support left/right/inner/outter join.

It's horizontal

'''

#For Vertical we should use Concat method

"\nJoin is used when we need to extract data from different dataframe which are having one or more common column\n\nPandas support left/right/inner/outter join.\n\nIt's horizontal\n\n"

In [8]:
# how to merge two dataframe in pandas

'''
Merge depends on the type and fields of different dataframe being merged

If data is having similar field data will be merge along axis 0

if fileds are diff then merge along axis =1


'''

'\nMerge depends on the type and fields of different dataframe being merged\n\nIf data is having similar field data will be merge along axis 0\n\nif fileds are diff then merge along axis =1\n\n\n'

In [9]:
# Remove all NaN rows -  Use drop.na

d={'col1':[0,1,None,4,5,None], 'col2':[0,9,7,5,6,None]}

df=pd.DataFrame(d)

df.dropna()

   col1  col2
0   0.0   0.0
1   1.0   9.0
3   4.0   5.0
4   5.0   6.0

In [10]:
df

   col1  col2
0   0.0   0.0
1   1.0   9.0
2   NaN   7.0
3   4.0   5.0
4   5.0   6.0
5   NaN   NaN

In [11]:
# Access the data by location
# loc method

df.loc[:4]

   col1  col2
0   0.0   0.0
1   1.0   9.0
2   NaN   7.0
3   4.0   5.0
4   5.0   6.0

In [12]:
#Most memory efficicent way to add element in tuple
'''
You can not add data in existing tuple so you have to create another tuple with old+new data

'''

'\nYou can not add data in existing tuple so you have to create another tuple with old+new data\n\n'

In [13]:
# Find out the meausre of central tendency for this numpy array

arr=np.array([1,5,3,100,4,48])
arr
print(np.mean(arr))
print(np.median(arr))
print(np.std(arr))

26.833333333333332
4.5
36.59424666377065

In [14]:
# What is the use of classifier?

#classifier is use to classify the data like in ml we classify the data in train and test

In [15]:
#With statement

'''
1) With stat is used in exception handling
2) With stat is used in opening a file, we don't need to close the file if it's open with with statement

'''

"\n1) With stat is used in exception handling\n2) With stat is used in opening a file, we don't need to close the file if it's open with with statement\n\n"

In [ ]:
# Map Function


l=list(map(int, input().split()))
l

In [17]:
#One more exp

def add_fun(n):
    return n*3

num=[1,2,3,4,5]
res=list(map(add_fun,num))
print(res)

[3, 6, 9, 12, 15]

In [18]:
#Tools to perform static analysis

'''
1) pychecker-    detect bugs from source code and warns about it style and complexity
2) pylint   -    check whether the module matched up a set coding standard



'''

'\n1) pychecker-    detect bugs from source code and warns about it style and complexity\n2) pylint   -    check whether the module matched up a set coding standard\n\n\n\n'

In [19]:
# Numpy vs SciPy

'''
Numpy- Numerical Python
Scipy- Scientific Python

Numpy is basic library, defines array and simple mathematic functions\
SciPy is advance llibrary, defined more complex function like integration, etc

'''

'\nNumpy- Numerical Python\nScipy- Scientific Python\n\nNumpy is basic library, defines array and simple mathematic functionsSciPy is advance llibrary, defined more complex function like integration, etc\n\n'

In [20]:
#Lambda function------

'''
Nameless function
for smaller tasks
one line function

'''

'\nNameless function\nfor smaller tasks\none line function\n\n'

In [45]:
#How to create new column in pandas by using values from another columns?


l1=[1,2,3]
l2=[4,5,6]

d={'col1':l1, 'col2':l2}

df=pd.DataFrame(d)
df['Sum']=df['col1']+df['col2']
df['Dif']=abs(df['col1']-df['col2'])
df

   col1  col2  Sum  Dif
0     1     4    5    3
1     2     5    7    3
2     3     6    9    3

In [ ]:
# Diff function of groupby

 '''
 groupby function is used for split and group the members
 
 some functions are------ sum(), mean(), count(), std)
 
 '''

In [ ]:
# How to select columnn in Pandas and add them to a new dataframe?
# What if there are two columns with the same name?
'''
we should use df.columns to get the all columns

we can then form new columns by selecting particular columns

if there are two column with the same name then both column get copied to the new data frame
'''

In [46]:
# How to delete a column or group of column in pandas?



df

   col1  col2  Sum  Dif
0     1     4    5    3
1     2     5    7    3
2     3     6    9    3

In [47]:
df = df.drop(['col1','Dif'], axis=1)
df

#Axis=0 = rowwise
#Axis=1 = coulmnwise

   col2  Sum
0     4    5
1     5    7
2     6    9

In [62]:
#In Give DF drop rows which have value 'A'

df=pd.DataFrame({'col1': [1,2,3,4,'A',5], 'col2': [5,'A',4,5,6,'B']})
df

  col1 col2
0    1    5
1    2    A
2    3    4
3    4    5
4    A    6
5    5    B

In [65]:
df[df!='A'].dropna()

  col1 col2
0    1    5
2    3    4
3    4    5
5    5    B

In [ ]:
# to find the highest paid player in each college in each team

#df.groupby(['College','Team'])['Salary'].max()

In [66]:
# Reindexing in python

#Reindexing the dataframe

df

  col1 col2
0    1    5
1    2    A
2    3    4
3    4    5
4    A    6
5    5    B

In [69]:
l=['A','B','C','D','E','F']
df.index=l

In [70]:
df

  col1 col2
A    1    5
B    2    A
C    3    4
D    4    5
E    A    6
F    5    B

In [ ]:
#Lambda function which will print the sum of all element in list

l=[5,8,10,20,50,100]

lambda total: total+